# Homebrew bundle — run from repo root: brew bundle
# Add formulae (cli tools) and casks (GUI apps) below. Then: brew bundle

# Taps (optional; uncomment if you use them)
# tap "homebrew/cask-fonts"

# Formulae (brew install)
brew "aria2"
brew "starship"
brew "kitty"
brew "eza"
brew "git"
brew "ncdu"
brew "yazi"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "mole"
brew "gitui"
brew "ncspot"
brew "xcodes"

# Casks (brew install --cask) — uncomment or add what you use
cask "cursor"
cask "alfred"
cask "google-chrome"